In [1]:
import yfinance as yf
import pandas as pd
import matplotlib.pyplot as plt


stock = yf.download("TSLA", start="2015-01-01", end="2025-08-09")

C:\Users\Navjot Kaushal\AppData\Local\Temp\ipykernel_18468\633369732.py:6: FutureWarning: YF.download() has changed argument auto_adjust default to True
  stock = yf.download("TSLA", start="2015-01-01", end="2025-08-09")
[*********************100%***********************]  1 of 1 completed

In [2]:
stock.head()

Price           Close       High        Low       Open    Volume
Ticker           TSLA       TSLA       TSLA       TSLA      TSLA
Date
2015-01-02  14.620667  14.883333  14.217333  14.858000  71466000
2015-01-05  14.006000  14.433333  13.810667  14.303333  80527500
2015-01-06  14.085333  14.280000  13.614000  14.004000  93928500
2015-01-07  14.063333  14.318667  13.985333  14.223333  44526000
2015-01-08  14.041333  14.253333  14.000667  14.187333  51637500

In [3]:
stock.to_csv('Tesla_Stock_data.csv')

In [4]:
df = pd.read_csv('Tesla_Stock_data.csv')

In [5]:
df.head()

,Price,Close,High,Low,Open,Volume
0,Ticker,TSLA,TSLA,TSLA,TSLA,TSLA
1,Date,NaN,NaN,NaN,NaN,NaN
2,2015-01-02,14.620667457580566,14.883333206176758,14.21733283996582,14.857999801635742,71466000
3,2015-01-05,14.005999565124512,14.433333396911621,13.810667037963867,14.303333282470703,80527500
4,2015-01-06,14.085332870483398,14.279999732971191,13.61400032043457,14.003999710083008,93928500

In [6]:
df.drop([0,1], inplace=True)

In [7]:
df.rename(columns={'Price':'Date'}, inplace=True)

In [8]:
df.head()

,Date,Close,High,Low,Open,Volume
2,2015-01-02,14.620667457580566,14.883333206176758,14.21733283996582,14.857999801635742,71466000
3,2015-01-05,14.005999565124512,14.433333396911621,13.810667037963867,14.303333282470703,80527500
4,2015-01-06,14.085332870483398,14.279999732971191,13.61400032043457,14.003999710083008,93928500
5,2015-01-07,14.063332557678223,14.3186674118042,13.985333442687988,14.223333358764648,44526000
6,2015-01-08,14.041333198547363,14.25333309173584,14.000666618347168,14.187333106994629,51637500

In [9]:
df['Date'] = pd.to_datetime(df['Date'])

In [10]:
col = (df.select_dtypes(include = 'object'))

for col in col :
   df[col] = pd.to_numeric(df[col])

In [11]:
df.head()

        Date      Close       High        Low       Open    Volume
2 2015-01-02  14.620667  14.883333  14.217333  14.858000  71466000
3 2015-01-05  14.006000  14.433333  13.810667  14.303333  80527500
4 2015-01-06  14.085333  14.280000  13.614000  14.004000  93928500
5 2015-01-07  14.063333  14.318667  13.985333  14.223333  44526000
6 2015-01-08  14.041333  14.253333  14.000667  14.187333  51637500

In [12]:
df.to_csv('Tesla_stock.csv', index=False)